resume.org
#+OPTIONS: toc:nil H:10 tex:t
#+STARTUP: hidestars indent
#+LaTeX_HEADER: \usepackage{mycv}
#+LaTeX_HEADER: \hypersetup{colorlinks=true, urlcolor={url-gray}}
#+LaTeX_CLASS_OPTIONS: [letterpaper]
#+LaTeX_HEADER: \usepackage{enumitem}
#+LaTeX_HEADER: \setlist{leftmargin=0.25in,nosep}
#+begin_center
Stanislav Karkavin

**Software engineer**

me@xdefrag.dev

t.me/xdefrag
#+end_center

* Skills:
**Principles:** TDD, Clean architecture

**Preferred tools:** Go, Kubernetes, GitlabCI, RabbitMQ, PostgreSQL, Redis, Protobuf

* Knowledge:
- Data structures and algorithms
- End-to-end system development lifecycle (from specification to production)
- Code-centric development through tests (unit/integration)

* Experience:

** Go Senior Developer / Team Lead at Devim
*** Aug 2019 - Now
Microservices development for Devim Finance platform and team management:
- Creating sharing knowledge culture
- Unit and integration testing, code style
- Creating definitions of Done (logging, metrics, tracing, code coverage requirements)
- Moving microservices from DCOS to Kubernetes

** Go Developer at Sudo team
*** Nov 2018 - Apr 2019
Architecture building and microservice development for Nanopool mining pool:
- Monorepo for microservices, common modules and tests
- CI with unit and integration testing, benchmarks and lint tools
- Dynamic configs and service discovery through Etcd in Docker Swarm environment
- Dynamic entities searching criteria creation through GRPC

** Team Lead at DevJS
*** Aug 2017 - Aug 2018
Architecture building and development of application's core business logic, configuring CI/CD, code review, developers team management (2-5 devs):
- Bank statements import system in any format
- Automatic account book
- Tax return generating system
- Dynamic prices with certain rules
- Helpdesk integration (Zammad)
- Google services integration (Calendar, Vision)

** Fullstack developer at MediaConnect
*** Jan 2017 - May 2017
System's modules development, code refactoring.

** Fullstack developer at Altai Tire Plant
*** Jun 2016 - Dec 2016
Web development.

** Fullstack developer at Webkot
*** Feb 2015 - Aug 2015
Web development.
