resume.tex
% Created 2020-06-09 Tue 13:14
% Intended LaTeX compiler: pdflatex
\documentclass[letterpaper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{mycv}
\hypersetup{colorlinks=true, urlcolor={url-gray}}
\usepackage{enumitem}
\setlist{leftmargin=0.25in,nosep}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\begin{center}
Stanislav Karkavin

\textbf{\textbf{Software engineer}}

me@xdefrag.dev

t.me/xdefrag
\end{center}

\section{Skills:}
\label{sec:orgd25c924}
\textbf{\textbf{Principles:}} TDD, Clean architecture

\textbf{\textbf{Preferred tools:}} Go, Kubernetes, GitlabCI, RabbitMQ, PostgreSQL, Redis, Protobuf

\section{Knowledge:}
\label{sec:orgacd92c7}
\begin{itemize}
\item Data structures and algorithms
\item End-to-end system development lifecycle (from specification to production)
\item Code-centric development through tests (unit/integration)
\end{itemize}

\section{Experience:}
\label{sec:org0ef5fdf}

\subsection{Go Senior Developer / Team Lead at Devim}
\label{sec:org46dc88a}
\subsubsection{Aug 2019 - Now}
\label{sec:orgab095e9}
Microservices development for Devim Finance platform and team management:
\begin{itemize}
\item Creating sharing knowledge culture
\item Unit and integration testing, code style
\item Creating definitions of Done (logging, metrics, tracing, code coverage requirements)
\item Moving microservices from DCOS to Kubernetes
\end{itemize}

\subsection{Go Developer at Sudo team}
\label{sec:org825d0d2}
\subsubsection{Nov 2018 - Apr 2019}
\label{sec:orgfc80c11}
Architecture building and microservice development for Nanopool mining pool:
\begin{itemize}
\item Monorepo for microservices, common modules and tests
\item CI with unit and integration testing, benchmarks and lint tools
\item Dynamic configs and service discovery through Etcd in Docker Swarm environment
\item Dynamic entities searching criteria creation through GRPC
\end{itemize}

\subsection{Team Lead at DevJS}
\label{sec:orga8ad2a6}
\subsubsection{Aug 2017 - Aug 2018}
\label{sec:orgb93c34a}
Architecture building and development of application's core business logic, configuring CI/CD, code review, developers team management (2-5 devs):
\begin{itemize}
\item Bank statements import system in any format
\item Automatic account book
\item Tax return generating system
\item Dynamic prices with certain rules
\item Helpdesk integration (Zammad)
\item Google services integration (Calendar, Vision)
\end{itemize}

\subsection{Fullstack developer at MediaConnect}
\label{sec:org03d9477}
\subsubsection{Jan 2017 - May 2017}
\label{sec:org5f32ebe}
System's modules development, code refactoring.

\subsection{Fullstack developer at Altai Tire Plant}
\label{sec:orgae94e67}
\subsubsection{Jun 2016 - Dec 2016}
\label{sec:orgf48e190}
Web development.

\subsection{Fullstack developer at Webkot}
\label{sec:orga843e6a}
\subsubsection{Feb 2015 - Aug 2015}
\label{sec:org1c6956c}
Web development.
\end{document}
